# Steps for Initial Data Review and Cleaning
## 1. Import Dependencies
## 2. Pull Data From Database into Dataframe
## 3. Evaluate Cleanliness and Consistency Of Data
## 4. Evaluate Columns for Unique Values to Understand if Columns have More Unique Values than Anticipated, Examples (Own a Car should only have 2 values, yes or no, same with Passport; Yes they have one, No they do not
#### * Examine Each Column Using groupby() and size() Functions to Obtain Row Count of Each Unique Value
#### * Fix Data in Columns Identified as Having Inconsistent Data
## 5. Evaluate Data for Null Values using count() Function
### * Identify Exact Quantity of Null Values for Each Column
## 6. Develop Strategy to Replace Null Values
#### * Used Sklearn SimpleImputer to Manage Null Values
#### * Deployed sklearn simpleimputer technique to replace numerical values with the mean of that column. Non-Numeric Null values used 'most_frequent' method to replace Nulls in remaining Columns
## 7. Store Cleaned Data to Database to be Pulled Down for Machine Learning Purposes

In [1]:
from path import Path
import pandas as pd
import numpy as np
from config import db_password
from sqlalchemy import create_engine
import re
import io
from sklearn.impute import SimpleImputer

In [2]:
#create connection string
db_string =f'postgresql://postgres:{db_password}@127.0.0.1:5432/Project Insights on the Beach'
engine = create_engine(db_string)
#read in the SQL data/ We dropped the customer_Id because it does not bring value to the analysis
vacay_df= pd.read_sql_query('''SELECT*FROM cust_marketing_table;''',engine)
vacay_df

,customerid,prodtaken,age,citytier,occupation,gender,numberofpersonvisiting,preferredpropertystar,maritalstatus,numberoftrips,passport,owncar,numberofchildrenvisiting,designation,monthlyincome,typeofcontact,durationofpitch,numberoffollowups,productpitched,pitchsatisfactionscore
0,200000,1,41.0,3,Salaried,Female,3,3.0,Single,1.0,1,1,0.0,Manager,20993.0,Self Enquiry,6.0,3.0,Deluxe,2
1,200001,0,49.0,1,Salaried,Male,3,4.0,Divorced,2.0,0,1,2.0,Manager,20130.0,Company Invited,14.0,4.0,Deluxe,3
2,200002,1,37.0,1,Free Lancer,Male,3,3.0,Single,7.0,1,0,0.0,Executive,17090.0,Self Enquiry,8.0,4.0,Basic,3
3,200003,0,33.0,1,Salaried,Female,2,3.0,Divorced,2.0,1,1,1.0,Executive,17909.0,Company Invited,9.0,3.0,Basic,5
4,200004,0,NaN,1,Small Business,Male,2,4.0,Divorced,1.0,0,1,0.0,Executive,18468.0,Self Enquiry,8.0,3.0,Basic,5
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4883,204883,1,49.0,3,Small Business,Male,3,4.0,Unmarried,2.0,1,1,1.0,Manager,26576.0,Self Enquiry,9.0,5.0,Deluxe,1
4884,204884,1,28.0,1,Salaried,Male,4,3.0,Single,3.0,1,1,2.0,Executive,21212.0,Company Invited,31.0,5.0,Basic,3
4885,204885,1,52.0,3,Salaried,Female,4,4.0,Married,7.0,0,1,3.0,Senior Manager,31820.0,Self Enquiry,17.0,4.0,Standard,1
4886,204886,1,19.0,3,Small Business,Male,3,3.0,Single,3.0,0,0,2.0,Executive,20289.0,Self Enquiry,16.0,4.0,Basic,5
4887,204887,1,36.0,1,Salaried,Male,4,4.0,Unmarried,3.0,1,1,2.0,Executive,24041.0,Self Enquiry,14.0,4.0,Basic,3

In [3]:
vacay_df.dtypes

customerid                    int64
prodtaken                     int64
age                         float64
citytier                      int64
occupation                   object
gender                       object
numberofpersonvisiting        int64
preferredpropertystar       float64
maritalstatus                object
numberoftrips               float64
passport                      int64
owncar                        int64
numberofchildrenvisiting    float64
designation                  object
monthlyincome               float64
typeofcontact                object
durationofpitch             float64
numberoffollowups           float64
productpitched               object
pitchsatisfactionscore        int64
dtype: object

In [4]:
#Return row counts of non-null values
vacay_df.count()

customerid                  4888
prodtaken                   4888
age                         4662
citytier                    4888
occupation                  4888
gender                      4888
numberofpersonvisiting      4888
preferredpropertystar       4862
maritalstatus               4888
numberoftrips               4748
passport                    4888
owncar                      4888
numberofchildrenvisiting    4822
designation                 4888
monthlyincome               4655
typeofcontact               4863
durationofpitch             4637
numberoffollowups           4843
productpitched              4888
pitchsatisfactionscore      4888
dtype: int64

In [5]:
# Number of unique row values per column
vacay_unique=vacay_df.nunique()
vacay_unique

customerid                  4888
prodtaken                      2
age                           44
citytier                       3
occupation                     4
gender                         3
numberofpersonvisiting         5
preferredpropertystar          3
maritalstatus                  4
numberoftrips                 12
passport                       2
owncar                         2
numberofchildrenvisiting       4
designation                    5
monthlyincome               2475
typeofcontact                  2
durationofpitch               34
numberoffollowups              6
productpitched                 5
pitchsatisfactionscore         5
dtype: int64

In [6]:
#How many Null Values are there per Column
vacay_null=vacay_df.isnull().sum(axis=0)
vacay_null

customerid                    0
prodtaken                     0
age                         226
citytier                      0
occupation                    0
gender                        0
numberofpersonvisiting        0
preferredpropertystar        26
maritalstatus                 0
numberoftrips               140
passport                      0
owncar                        0
numberofchildrenvisiting     66
designation                   0
monthlyincome               233
typeofcontact                25
durationofpitch             251
numberoffollowups            45
productpitched                0
pitchsatisfactionscore        0
dtype: int64

In [7]:
##Merge the count dataframe, unique value df and null dataframe and apply header
vacay_eda_merged = pd.concat({"ValueCounts":vacay_df.count(),"UniqueValues": vacay_unique, "Nulls": vacay_null},axis =1, join = "inner")
vacay_eda_merged

                          ValueCounts  UniqueValues  Nulls
customerid                       4888          4888      0
prodtaken                        4888             2      0
age                              4662            44    226
citytier                         4888             3      0
occupation                       4888             4      0
gender                           4888             3      0
numberofpersonvisiting           4888             5      0
preferredpropertystar            4862             3     26
maritalstatus                    4888             4      0
numberoftrips                    4748            12    140
passport                         4888             2      0
owncar                           4888             2      0
numberofchildrenvisiting         4822             4     66
designation                      4888             5      0
monthlyincome                    4655          2475    233
typeofcontact                    4863             2     25
durationofpitch                  4637            34    251
numberoffollowups                4843             6     45
productpitched                   4888             5      0
pitchsatisfactionscore           4888             5      0

In [8]:
# return values in Gender Column
vacay_df.groupby('gender').size()

gender
Fe Male     155
Female     1817
Male       2916
dtype: int64

In [9]:
#Replace all values of 'Fe Male' with Female, DataCleaning
vacay_df=vacay_df.replace("Fe Male", "Female")
vacay_df.groupby('gender').size()

gender
Female    1972
Male      2916
dtype: int64

In [10]:
# return values in MaritalStatus Column
vacay_df.groupby('maritalstatus').size()

maritalstatus
Divorced      950
Married      2340
Single        916
Unmarried     682
dtype: int64

In [11]:
#replace Divorce and Unmarried value with Single
vacay_df = vacay_df.replace(["Divorced", "Unmarried"], ["Single","Single"])
#CheckResults
vacay_df.groupby('maritalstatus').size()

maritalstatus
Married    2340
Single     2548
dtype: int64

In [12]:
# Return values in OwnCar Column
vacay_df.groupby('owncar').size()

owncar
0    1856
1    3032
dtype: int64

In [13]:
# Drop Column believed to be unimportant to analysis
#vacay_df.drop('OwnCar', inplace=True, axis = 1)
#vacay_df.head()

In [14]:
# Verify values in age made sense
vacay_df.groupby('age').size()

age
18.0     14
19.0     32
20.0     38
21.0     41
22.0     46
23.0     46
24.0     56
25.0     74
26.0    106
27.0    138
28.0    147
29.0    178
30.0    199
31.0    203
32.0    197
33.0    189
34.0    211
35.0    237
36.0    231
37.0    185
38.0    176
39.0    150
40.0    146
41.0    155
42.0    142
43.0    130
44.0    105
45.0    116
46.0    121
47.0     88
48.0     65
49.0     65
50.0     86
51.0     90
52.0     68
53.0     66
54.0     61
55.0     64
56.0     58
57.0     29
58.0     31
59.0     44
60.0     29
61.0      9
dtype: int64

In [15]:
# Verify values in CityTier made sense
vacay_df.groupby('citytier').size()

citytier
1    3190
2     198
3    1500
dtype: int64

In [16]:
# Verify values in DurationOfPitch made sense
vacay_df.groupby('durationofpitch').size()

durationofpitch
5.0        6
6.0      307
7.0      342
8.0      333
9.0      483
10.0     244
11.0     205
12.0     195
13.0     223
14.0     253
15.0     269
16.0     274
17.0     172
18.0      75
19.0      57
20.0      65
21.0      73
22.0      89
23.0      79
24.0      70
25.0      73
26.0      72
27.0      72
28.0      61
29.0      74
30.0      95
31.0      83
32.0      74
33.0      57
34.0      50
35.0      66
36.0      44
126.0      1
127.0      1
dtype: int64

In [17]:
# Verify values in Occupation made sense
vacay_df.groupby('occupation').size()

occupation
Free Lancer          2
Large Business     434
Salaried          2368
Small Business    2084
dtype: int64

In [18]:
# Verify values in NumberOfPersonVisiting made sense
vacay_df.groupby('numberofpersonvisiting').size()

numberofpersonvisiting
1      39
2    1418
3    2402
4    1026
5       3
dtype: int64

In [19]:
# Verify values in NumberOfFollowups made sense
vacay_df.groupby('numberoffollowups').size()

numberoffollowups
1.0     176
2.0     229
3.0    1466
4.0    2068
5.0     768
6.0     136
dtype: int64

In [20]:
# Verify values in NumberOfPersonVisiting made sense
vacay_df.groupby('productpitched').size()

productpitched
Basic           1842
Deluxe          1732
King             230
Standard         742
Super Deluxe     342
dtype: int64

In [21]:
# Verify values in PreferredPropertyStar made sense
vacay_df.groupby('preferredpropertystar').size()

preferredpropertystar
3.0    2993
4.0     913
5.0     956
dtype: int64

In [22]:
# Verify values in NumberOfTrips made sense
vacay_df.groupby('numberoftrips').size()

numberoftrips
1.0      620
2.0     1464
3.0     1079
4.0      478
5.0      458
6.0      322
7.0      218
8.0      105
19.0       1
20.0       1
21.0       1
22.0       1
dtype: int64

In [23]:
# Verify values in Passport made sense
vacay_df.groupby('passport').size()

passport
0    3466
1    1422
dtype: int64

In [24]:
# Verify values in PitchSatisfactionScore made sense
vacay_df.groupby('pitchsatisfactionscore').size()

pitchsatisfactionscore
1     942
2     586
3    1478
4     912
5     970
dtype: int64

In [25]:
# Verify values in NumberOfPersonVisiting made sense
vacay_df.groupby('numberofchildrenvisiting').size()

numberofchildrenvisiting
0.0    1082
1.0    2080
2.0    1335
3.0     325
dtype: int64

In [26]:
# Verify values in Designation made sense
vacay_df.groupby('designation').size()

designation
AVP                342
Executive         1842
Manager           1732
Senior Manager     742
VP                 230
dtype: int64

In [27]:
# Verify values in MonthlyIncome made sense
vacay_df.groupby('monthlyincome').size()

monthlyincome
1000.0     1
4678.0     1
16009.0    2
16051.0    2
16052.0    2
          ..
38621.0    2
38651.0    2
38677.0    2
95000.0    1
98678.0    1
Length: 2475, dtype: int64

In [28]:
# Number of unique row values per column
vacay_unique=vacay_df.nunique()
#How many Null Values are there per Column
vacay_null=vacay_df.isnull().sum(axis=0)
#Three df Merged
vacay_eda_merged = pd.concat({"ValueCounts":vacay_df.count(),"UniqueValues": vacay_unique, "Nulls": vacay_null},axis =1, join = "inner")
vacay_eda_merged

                          ValueCounts  UniqueValues  Nulls
customerid                       4888          4888      0
prodtaken                        4888             2      0
age                              4662            44    226
citytier                         4888             3      0
occupation                       4888             4      0
gender                           4888             2      0
numberofpersonvisiting           4888             5      0
preferredpropertystar            4862             3     26
maritalstatus                    4888             2      0
numberoftrips                    4748            12    140
passport                         4888             2      0
owncar                           4888             2      0
numberofchildrenvisiting         4822             4     66
designation                      4888             5      0
monthlyincome                    4655          2475    233
typeofcontact                    4863             2     25
durationofpitch                  4637            34    251
numberoffollowups                4843             6     45
productpitched                   4888             5      0
pitchsatisfactionscore           4888             5      0

In [29]:
vacay_drop_null = vacay_df.dropna()

In [30]:
vacay_drop_null.count()

customerid                  4128
prodtaken                   4128
age                         4128
citytier                    4128
occupation                  4128
gender                      4128
numberofpersonvisiting      4128
preferredpropertystar       4128
maritalstatus               4128
numberoftrips               4128
passport                    4128
owncar                      4128
numberofchildrenvisiting    4128
designation                 4128
monthlyincome               4128
typeofcontact               4128
durationofpitch             4128
numberoffollowups           4128
productpitched              4128
pitchsatisfactionscore      4128
dtype: int64

In [31]:
imputer = SimpleImputer(strategy='mean', missing_values=np.nan)
imputer = imputer.fit(vacay_df[['age','durationofpitch','numberoffollowups','preferredpropertystar','numberoftrips','numberofchildrenvisiting','monthlyincome']])
vacay_df[['age','durationofpitch','numberoffollowups','preferredpropertystar','numberoftrips','numberofchildrenvisiting','monthlyincome']] = imputer.transform(vacay_df[['age','durationofpitch','numberoffollowups','preferredpropertystar','numberoftrips','numberofchildrenvisiting','monthlyincome']])
vacay_df

,customerid,prodtaken,age,citytier,occupation,gender,numberofpersonvisiting,preferredpropertystar,maritalstatus,numberoftrips,passport,owncar,numberofchildrenvisiting,designation,monthlyincome,typeofcontact,durationofpitch,numberoffollowups,productpitched,pitchsatisfactionscore
0,200000,1,41.000000,3,Salaried,Female,3,3.0,Single,1.0,1,1,0.0,Manager,20993.0,Self Enquiry,6.0,3.0,Deluxe,2
1,200001,0,49.000000,1,Salaried,Male,3,4.0,Single,2.0,0,1,2.0,Manager,20130.0,Company Invited,14.0,4.0,Deluxe,3
2,200002,1,37.000000,1,Free Lancer,Male,3,3.0,Single,7.0,1,0,0.0,Executive,17090.0,Self Enquiry,8.0,4.0,Basic,3
3,200003,0,33.000000,1,Salaried,Female,2,3.0,Single,2.0,1,1,1.0,Executive,17909.0,Company Invited,9.0,3.0,Basic,5
4,200004,0,37.622265,1,Small Business,Male,2,4.0,Single,1.0,0,1,0.0,Executive,18468.0,Self Enquiry,8.0,3.0,Basic,5
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4883,204883,1,49.000000,3,Small Business,Male,3,4.0,Single,2.0,1,1,1.0,Manager,26576.0,Self Enquiry,9.0,5.0,Deluxe,1
4884,204884,1,28.000000,1,Salaried,Male,4,3.0,Single,3.0,1,1,2.0,Executive,21212.0,Company Invited,31.0,5.0,Basic,3
4885,204885,1,52.000000,3,Salaried,Female,4,4.0,Married,7.0,0,1,3.0,Senior Manager,31820.0,Self Enquiry,17.0,4.0,Standard,1
4886,204886,1,19.000000,3,Small Business,Male,3,3.0,Single,3.0,0,0,2.0,Executive,20289.0,Self Enquiry,16.0,4.0,Basic,5
4887,204887,1,36.000000,1,Salaried,Male,4,4.0,Single,3.0,1,1,2.0,Executive,24041.0,Self Enquiry,14.0,4.0,Basic,3

In [32]:
vacay_df.count()

customerid                  4888
prodtaken                   4888
age                         4888
citytier                    4888
occupation                  4888
gender                      4888
numberofpersonvisiting      4888
preferredpropertystar       4888
maritalstatus               4888
numberoftrips               4888
passport                    4888
owncar                      4888
numberofchildrenvisiting    4888
designation                 4888
monthlyincome               4888
typeofcontact               4863
durationofpitch             4888
numberoffollowups           4888
productpitched              4888
pitchsatisfactionscore      4888
dtype: int64

In [33]:
imputer = SimpleImputer(strategy='most_frequent', 
                        missing_values=np.nan)
imputer = imputer.fit(vacay_df[['typeofcontact']])
vacay_df[['typeofcontact']] = imputer.transform(vacay_df[['typeofcontact']])
vacay_df

,customerid,prodtaken,age,citytier,occupation,gender,numberofpersonvisiting,preferredpropertystar,maritalstatus,numberoftrips,passport,owncar,numberofchildrenvisiting,designation,monthlyincome,typeofcontact,durationofpitch,numberoffollowups,productpitched,pitchsatisfactionscore
0,200000,1,41.000000,3,Salaried,Female,3,3.0,Single,1.0,1,1,0.0,Manager,20993.0,Self Enquiry,6.0,3.0,Deluxe,2
1,200001,0,49.000000,1,Salaried,Male,3,4.0,Single,2.0,0,1,2.0,Manager,20130.0,Company Invited,14.0,4.0,Deluxe,3
2,200002,1,37.000000,1,Free Lancer,Male,3,3.0,Single,7.0,1,0,0.0,Executive,17090.0,Self Enquiry,8.0,4.0,Basic,3
3,200003,0,33.000000,1,Salaried,Female,2,3.0,Single,2.0,1,1,1.0,Executive,17909.0,Company Invited,9.0,3.0,Basic,5
4,200004,0,37.622265,1,Small Business,Male,2,4.0,Single,1.0,0,1,0.0,Executive,18468.0,Self Enquiry,8.0,3.0,Basic,5
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4883,204883,1,49.000000,3,Small Business,Male,3,4.0,Single,2.0,1,1,1.0,Manager,26576.0,Self Enquiry,9.0,5.0,Deluxe,1
4884,204884,1,28.000000,1,Salaried,Male,4,3.0,Single,3.0,1,1,2.0,Executive,21212.0,Company Invited,31.0,5.0,Basic,3
4885,204885,1,52.000000,3,Salaried,Female,4,4.0,Married,7.0,0,1,3.0,Senior Manager,31820.0,Self Enquiry,17.0,4.0,Standard,1
4886,204886,1,19.000000,3,Small Business,Male,3,3.0,Single,3.0,0,0,2.0,Executive,20289.0,Self Enquiry,16.0,4.0,Basic,5
4887,204887,1,36.000000,1,Salaried,Male,4,4.0,Single,3.0,1,1,2.0,Executive,24041.0,Self Enquiry,14.0,4.0,Basic,3

In [34]:
vacay_df.count()

customerid                  4888
prodtaken                   4888
age                         4888
citytier                    4888
occupation                  4888
gender                      4888
numberofpersonvisiting      4888
preferredpropertystar       4888
maritalstatus               4888
numberoftrips               4888
passport                    4888
owncar                      4888
numberofchildrenvisiting    4888
designation                 4888
monthlyincome               4888
typeofcontact               4863
durationofpitch             4888
numberoffollowups           4888
productpitched              4888
pitchsatisfactionscore      4888
dtype: int64

In [35]:
#vacay_df.to_csv('../Resources/TravelCleanedSkiLearnImputer.csv',index = False )

 ### 7. Pull dataframe to SQL database

In [36]:

vacay_df.head(0).to_sql('cleaned_up_cust_marketing_table', engine, if_exists='replace',index=False) #creates new empty table

conn = engine.raw_connection()
cur = conn.cursor()
output = io.StringIO()
vacay_df.to_csv(output, sep='\t', header=False, index=False)
output.seek(0)
contents = output.getvalue()
cur.copy_from(output, 'cleaned_up_cust_marketing_table', null="") # null values become ''
conn.commit()